Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: It is ideal for plugin systems, allowing users to write safe plugins in any language (Rust, C++, Go, etc.) that compiles to Wasm, and running them inside a Java app. It can be used for Serverless/Edge Computing cases, as it provides a mean to run lightweight logic on Java-based infrastructure without the overhead of application containers.
ja_jp: これはプラグインシステムに理想的であり、ユーザーが Wasm にコンパイルされる任意の言語 (Rust、C++、Go など) で安全なプラグインを記述し、それを Java アプリ内で実行できるようにします。また、Java ベースのインフラストラクチャー上でアプリケーションコンテナーのオーバーヘッドなしに軽量なロジックを実行する手段を提供するため、サーバーレスやエッジコンピューティングのケースにも使用できます。

source: It is important because there are significant differences between Elasticsearch mapping syntax depending on the version. Since the mapping is created at build time to reduce startup time, Hibernate Search cannot connect to the cluster to automatically detect the version. Note that, for OpenSearch, you need to prefix the version with `opensearch:`; see <<opensearch>>.
ja_jp: Elasticsearch のマッピング構文はバージョンによって大きく異なるため、これは重要です。 起動時間を短縮するためにマッピングはビルド時に作成されるため、Hibernate Search はクラスターに接続して自動的にバージョンを検出することができません。 OpenSearch の場合、バージョンの前に `opensearch:` を付ける必要がある点に注意してください。<<opensearch>> を参照してください。

source: It is important that `quarkus.keycloak.admin-client.server-url` is configured if you would like to have `Keycloak` injected. The injection will fail if you attempt to inject `Keycloak` without configuring this property.
ja_jp: `Keycloak` をインジェクションしたい場合は、 `quarkus.keycloak.admin-client.server-url` を設定することが重要です。このプロパティを設定せずに `Keycloak` をインジェクションしようとすると、インジェクションは失敗します。

source: It is important that the alternative be present in the `src/test/java` directory rather than `src/main/java`, as otherwise it will take effect all the time, not just when testing.
ja_jp: 代替品が `src/main/java` ではなく `src/test/java` ディレクトリーに存在することが重要です。そうでなければ、テスト以外も常に有効になってしまいます。

source: It is important that this error endpoint is a public resource to avoid the user redirected to this page be authenticated again.
ja_jp: このエラーエンドポイントは、このページにリダイレクトされたユーザーが再び認証されることを避けるために、パブリックリソースであることが重要です。

source: It is important that you enable all origins only for the dev profile, allowing all origins in production is not recommended and could expose your applications to serious security issues.
ja_jp: dev プロファイルに対してのみすべてのオリジンを有効にすることが重要です。本番環境ですべてのオリジンを許可することは推奨されていません。アプリケーションが重大なセキュリティ問題にさらされる可能性があります。

source: It is important to clarify that we do not recommend using the deprecated OAuth2 `password` token grant in production. However using it can help testing the endpoint with tokens acquired from the live dev Auth0 tenant.
ja_jp: ここで明確にする必要があるのですが、実稼働環境で非推奨の OAuth2 `password` トークングラントを使用することは推奨されません。ただし、それの使用は、ライブ開発 Auth0 テナントから取得したトークンを使用してエンドポイントをテストする場合に役立ちます。

source: It is important to measure the whole memory to see the impact of a Cloud Native application. It is particularly true of container environments which will kill a process based on its full RSS memory usage.
ja_jp: Cloud Nativeアプリケーションの影響を見るためには、メモリー全体を測定することが重要です。特にRSSメモリーの全使用量に基づいてプロセスを強制終了させてしまうことがあるコンテナー環境では特にそうです。

source: It is important to note that gauges are sampled rather than set; there is no record of how the value associated with a gauge might have changed between measurements. In this example, the size of the list is observed when the Prometheus endpoint is visited.
ja_jp: ゲージは設定されるのではなくサンプリングされることに注意してください。ゲージに関連付けられた値が測定間でどのように変化したかについての記録はありません。 この例では、Prometheusエンドポイントにアクセスしたときにリストのサイズが計測されます。

source: It is important to note that this customization is only performed for the serialization of the JAX-RS methods that use `@CustomSerialization(UnquotedFields.class)`.
ja_jp: このカスタマイズは `@CustomSerialization(UnquotedFields.class)` を使用する JAX-RS メソッドのシリアル化にのみ行われることに注意することが重要です。

source: It is important to note that this customization is only performed for the serialization of the Jakarta REST methods that use `@CustomSerialization(UnquotedFields.class)`.
ja_jp: このカスタマイズは、 `@CustomSerialization(UnquotedFields.class)` を使用する Jakarta REST メソッドのシリアライズに対してのみ実行されることに注意する必要があります。

source: It is important to remember that when configuring Derby to use the embedded engine, this will work as usual in JVM mode but such an application will not compile into a native executable, as the Quarkus extensions only cover for making the JDBC client code compatible with the native compilation step: embedding the whole database engine into a native executable is currently not implemented.
ja_jp: 組込エンジンを使用するように H2 (または Derby) を設定する場合、JVM モードでは通常通り動作しますが、そのようなアプリケーションはネイティブ実行可能ファイルにはコンパイルされません。これは、Quarkus エクステンションが、JDBC クライアントコードをネイティブコンパイルステップに対応させることのみを対象としているためです。データベースエンジン全体のネイティブ実行可能ファイルへの組込は現在実装されていません。

source: It is important to remember that when configuring H2 (or Derby) to use the embedded engine, this will work as usual in JVM mode but such an application will not compile into a native executable, as the Quarkus extensions only cover for making the JDBC client code compatible with the native compilation step: embedding the whole database engine into a native executable is currently not implemented.
ja_jp: 埋め込みエンジンを使用するように H2 (または Derby) を設定する場合、JVM モードでは通常通り動作しますが、そのようなアプリケーションはネイティブ実行可能ファイルにはコンパイルされません。これは、Quarkus 拡張が、JDBC クライアントコードをネイティブコンパイルステップに対応させることのみを対象としているためです。データベースエンジン全体のネイティブ実行可能ファイルへの組み込みは現在実装されていません。

source: It is important to specify all the required artifacts to be added to the indexer. No artifacts are implicitly added transitively.
ja_jp: インデクサーに追加する必要のあるすべてのアーティファクトを指定することが重要です。暗黙的にアーティファクトが推移的に追加されることはありません。

source: It is important to understand that a method body that uses imperative code only becomes a problem when it takes a long time to execute - which is almost always the case for blocking IO operations.
ja_jp: 命令型コードを使用するメソッド本体が問題になるのは、実行に長い時間がかかるときだけ - ブロッキング IO 処理がほぼ全てのケース - であることを理解することが重要です。

source: It is important to use the correct `ClassLoader`. The recommended approach is to get it by calling the `Thread.currentThread().getContextClassLoader()` method.
ja_jp: 正しい `ClassLoader` を使用することが重要です。推奨される方法は、 `Thread.currentThread().getContextClassLoader()` メソッドを呼び出して取得することです。

source: It is impossible to use the `ThreadLocalSessionContext` helper of Hibernate ORM as support for it is not implemented. Since Quarkus provides out-of-the-box CDI support, injection or programmatic CDI lookup is a better approach. This feature also didn't integrate well with reactive components and more modern context propagation techniques, making us believe this legacy feature has no future. If you badly need to bind it to a ThreadLocal, it should be trivial to implement in your own code.
ja_jp: Hibernate ORM の `ThreadLocalSessionContext` ヘルパーは、サポートが実装されていないため使用できません。 Quarkus は CDI サポートを最初から提供しているので、注入やプログラムによる CDI ルックアップがより良いアプローチとなります。 この機能は、リアクティブコンポーネントやより最新のコンテキスト伝播技術ともうまく統合されなかったため、このレガシー機能には将来性がないと考えられます。 どうしても ThreadLocal にバインドする必要がある場合は、独自のコードで簡単に実装できるはずです。

source: It is likely that the annotation class is not part of the application index. For example, classes from the _runtime module_ of a Quarkus extension are not indexed automatically.
ja_jp: アノテーションクラスがアプリケーションインデックスに含まれていない可能性があります。たとえば、Quarkus エクステンションの _ランタイムモジュール_ のクラスは自動的にインデックス化されません。

source: It is my great pleasure to announce the release of Quarkus 2.6.0.Final which comes with some nice changes:
ja_jp: いくつかの素晴らしい変更が加えられたQuarkus 2.6.0.Finalのリリースを発表できることを大変嬉しく思います。

source: It is my pleasure to announce the availability of Quarkus 2.9.1.Final, the first maintenance release of our 2.9 release.
ja_jp: 2.9リリースの最初のメンテナンスリリースであるQuarkus 2.9.1.Finalのリリースを発表できることを嬉しく思います。

source: It is my pleasure to announce the release of Quarkus 1.12.0.Final.
ja_jp: Quarkus 1.12.0.Finalのリリースを発表できることを嬉しく思います。

source: It is not a good idea to do re-augmentation at runtime unless you miss the good old times when starting up a server took several minutes and you could enjoy a cup of coffee until it was ready.
ja_jp: サーバーの起動に数分かかり、準備が整うまでコーヒーを楽しむことができた古き良き時代を懐かしむのでなければ、実行時に再オーグメンテーションを行うのは得策ではありません。

source: It is not a good idea to do re-augmentation at runtime unless you miss the good old times when starting up a server took several minutes, and you could enjoy a cup of coffee until it was ready.
ja_jp: サーバーの起動に数分かかり、準備が整うまでコーヒーを楽しむことができた古き良き時代を懐かしむのでなければ、ランタイムに再オーグメンテーションを行うことは得策ではありません。

source: It is not always obvious that this will fail especially if you depend on an extension like `quarkus-undertow` which supplies the interfaces. For example, if you write this you could compile it but get an exception on calling it:
ja_jp: 特に、 `quarkus-undertow` のような、インターフェイスを提供するエクステンションに依存している場合、これが失敗するとは限りません。 たとえば、これをコンパイル出来ても、呼び出すときに例外が発生します：

source: It is not necessary (but possible) to https://quarkiverse.github.io/quarkiverse-docs/quarkus-quinoa/dev/#package-manager[configure the package manager] (NPM, Yarn or PNPM), it will be auto-detected depending on the project lockfile.
ja_jp: link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-quinoa/dev/#package-manager[パッケージマネージャ] （NPM、Yarn、PNPM）を link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-quinoa/dev/#package-manager[設定] する必要はありません（可能です）。プロジェクトのロックファイルによって自動的に検出されます。

source: It is not necessary to call all methods on the builder, but either for owned services, `startable()`, `serviceName()`, `configProvider()`, and link:#eligibility-for-reuse[`serviceConfig()`] are almost always needed
ja_jp: ビルダーのすべてのメソッドを呼び出す必要はありませんが、所有(owned)サービスの場合は `startable()` 、 `serviceName()` 、 `configProvider()` 、および link:#eligibility-for-reuse[`serviceConfig()`] がほぼ常に必要になります。

source: It is not possible for Quarkus to determine at build time the type included in the `Response` as the information is not available. In this case, Quarkus won't be able to automatically register for reflection the required classes.
ja_jp: `Response` に含まれるタイプは情報がないため、Quarkusがビルド時に判断することはできません。この場合、Quarkusは必要なクラスを自動的に反映登録することができません。

source: It is not possible to conditionally enable/disable additional beans via the `@IfBuildProfile`, `@UnlessBuildProfile`, `@IfBuildProperty` and `@UnlessBuildProperty` annotations as described in <<cdi-reference.adoc#enable_build_profile>> and <<cdi-reference.adoc#enable_build_properties>>. Extensions should inspect the configuration or the current profile and only produce an `AdditionalBeanBuildItem` if really needed.
ja_jp: <<cdi-reference.adoc#enable_build_profile>> および <<cdi-reference.adoc#enable_build_properties>> で説明されているように、 `@IfBuildProfile`, `@UnlessBuildProfile`, `@IfBuildProperty` および `@UnlessBuildProperty` アノテーションを介して、条件付きで追加のBeanを有効化/無効化することはできません。エクステンションは、設定または現在のプロファイルを検査し、本当に必要な場合にのみ `AdditionalBeanBuildItem` を生成するべきです。

source: It is not possible to conditionally enable/disable additional beans via the `@IfBuildProfile`, `@UnlessBuildProfile`, `@IfBuildProperty` and `@UnlessBuildProperty` annotations as described in xref:cdi-reference.adoc#enable_build_profile[Enabling Beans for Quarkus Build Profile] and xref:cdi-reference.adoc#enable_build_properties[Enabling Beans for Quarkus Build Properties]. Extensions should inspect the configuration or the current profile and only produce an `AdditionalBeanBuildItem` if really needed.
ja_jp: xref:cdi-reference.adoc#enable_build_profile[Quarkus Build ProfileでのBeanの有効化] と xref:cdi-reference.adoc#enable_build_properties[Quarkus Build PropertiesでのBeanの有効化] で説明されているように、 `@IfBuildProfile` 、 `@UnlessBuildProfile` 、 `@IfBuildProperty` 、 `@UnlessBuildProperty` アノテーションによって追加のBeanを条件付きで有効/無効にすることは不可能です。エクステンションは、設定または現在のプロファイルを検査し、本当に必要な場合にのみ `AdditionalBeanBuildItem` を生成する必要があります。

source: It is not possible to have a HQL `select new` query and `.project(Class)` at the same time - you need to pick one approach.
ja_jp: HQL の `select new` クエリと `.project(Class)` を同時に使えません。どちらかの方法を選択してください。

source: It is not possible to inject a `Template` instance and vice versa - a template cannot inject a `@Named` CDI bean via the `inject:` and `cdi:` namespace.
ja_jp: `Template` インスタンスを注入することはできませんし、その逆もできません。テンプレートは、`inject:` および `cdi:` の名前空間を介して `@Named` CDI Bean を注入することはできません。

source: It is not possible to inject a `Template` instance and vice versa - a template cannot inject a `@Named` CDI bean via the `inject:` namespace.
ja_jp: `Template` インスタンスを注入することはできませんし、その逆もできません。テンプレートは、 `inject:` 名前空間を介して `@Named` CDI Bean を注入することはできません。

source: It is not possible to use a custom test configuration profile in native mode for now. Native tests are always run using the `prod` profile.
ja_jp: 今のところ、ネイティブモードでカスタムテスト設定プロファイルを使用することはできません。ネイティブテストは常に `prod` プロファイルを使用して実行されます。

source: It is not possible to use the `ThreadLocalSessionContext` helper of Hibernate ORM as support for it is not implemented. Since Quarkus provides out of the box support for CDI, we believe using injection or programmatic CDI lookup to be a better approach. This feature also didn't integrate well with reactive components and more modern context propagation techniques, making us believe this legacy feature has no future. If you badly need to bind it to a ThreadLocal it should be trivial to implement in your own code.
ja_jp: Hibernate ORMの `ThreadLocalSessionContext` ヘルパーはサポートが実装されていないため、使用することはできません。QuarkusはCDIのアウトオブボックスサポートを提供しているため、インジェクションまたはプログラムによるCDIルックアップを使用する方が良いアプローチであると考えられます。また、この機能は、リアクティブコンポーネントやより現代的なコンテキストプロパゲーション技術とうまく統合されていないため、このレガシー機能には将来性がないと考えています。もし、ThreadLocal にバインドする必要があるのなら、あなた自身のコードで実装するのは簡単なはずです。

source: It is not recommenced to do any business logic in this main method, as Quarkus has not been set up yet, and Quarkus may run in a different ClassLoader. If you want to perform logic on startup use an `io.quarkus.runtime.QuarkusApplication` as described below.
ja_jp: まだQuarkusが設定されておらず、Quarkusは別のClassLoaderで動作する可能性があるため、このメインメソッドでビジネスロジックを行うことは推奨されていません。起動時にロジックを実行したい場合は、以下のように `io.quarkus.runtime.QuarkusApplication` を使用してください。

source: It is not recommended to include the whole configuration documentation in the middle of your guide as it's heavy. If you have an `application.properties` extract with your configuration, just do as follows.
ja_jp: 設定ドキュメント全体をガイドの途中に入れるのは、重いのでお勧めできません。設定から抽出した `application.properties` がある場合は、以下のようにすればよいでしょう。

source: It is not recommended to use the `aot-jar` packaging outside of the AOT use case, as the `fast-jar` packaging offers more optimizations that result in better performance compared to the `aot-jar` when Leyden's AOT cache is not used.
ja_jp: Leyden の AOT キャッシュを使用しない場合は、 `fast-jar` パッケージングの方が `aot-jar` よりも優れたパフォーマンスをもたらす多くの最適化を提供するため、AOT 以外のユースケースで `aot-jar` パッケージングを使用することはお勧めしません。

source: It is not uncommon however to need to convert a single query parameter into a collection of values based on some delimiting character. That is where the `@org.jboss.resteasy.reactive.Separator` annotation comes into play.
ja_jp: ただし、何らかの区切り文字に基づいて、単一のクエリーパラメーターを、値のコレクションに変換する必要があることは珍しくありません。このような場合に、 `@org.jboss.resteasy.reactive.Separator` アノテーションが役立ちます。

source: It is not uncommon that an application has to interact with enterprise systems (like CRM systems) using a special protocol called https://www.odata.org/documentation/odata-version-3-0/batch-processing/[OData]. This protocol essentially uses a custom HTTP `Content-Type` which needs some glue code to work with the REST Client (creating the body is entirely up to the application - the REST Client can't do much to help).
ja_jp: アプリケーションが、 https://www.odata.org/documentation/odata-version-3-0/batch-processing/[OData] と呼ばれる特別なプロトコルを使用してエンタープライズシステム (CRM システムなど) と対話する必要があることは珍しくありません。 このプロトコルは基本的に、REST Client で動作するためにいくつかのグルーコードを必要とするカスタム HTTP `Content-Type` を使用します (本体の作成は完全にアプリケーション次第であり、REST Client はあまり役に立ちません)。

source: It is now easier than ever to use Mutiny with the REST Client thanks to the `quarkus-rest-client-mutiny` extension.
ja_jp: `quarkus-rest-client-mutiny` エクステンションのおかげで、REST クライアントで Mutiny を使用することがこれまで以上に簡単になりました。

source: It is now possible to configure the Quartz by setting the `quarkus.quartz.instance-name` configuration property.
ja_jp: `quarkus.quartz.instance-name` 設定プロパティーを設定することで、Quartzの設定が可能になりました。

source: It is now possible to customize the Hibernate Validator `ValidatorFactory` with beans implementing `HibernateValidatorFactoryCustomizer`.
ja_jp: `HibernateValidatorFactoryCustomizer` を実装した Bean で、Hibernate Validator `ValidatorFactory` をカスタマイズすることが可能になりました。

source: It is now possible to declare any properties supported by Hibernate ORM with the `quarkus.hibernate-orm.unsupported-properties` configuration property (which is configurable per persistence unit).
ja_jp: Hibernate ORM がサポートする任意のプロパティを `quarkus.hibernate-orm.unsupported-properties` 設定プロパティで定義できるようになりました (これは、永続化ユニットごとに設定可能です)。

source: It is now possible to define service bindings using Quarkus configuration as explained in the link:/guides/deploying-to-kubernetes#service_binding[Deploying to Kubernetes] guide.
ja_jp: link:/guides/deploying-to-kubernetes#service_binding[Deploying to Kubernetes]ガイドで説明されているように、Quarkusの設定を使ってサービスバインディングを定義することが可能になりました。

source: It is now possible to disable all the Dev Services at once with `quarkus.devservices.enabled=false`.
ja_jp: `quarkus.devservices.enabled=false` で、すべてのDevサービスを一度に無効にすることができるようになりました。

source: It is now possible to generate initial migration scripts from the Hibernate ORM generated schema from the Dev UI.
ja_jp: Dev UI から Hibernate ORM で生成されたスキーマで初期移行スクリプトを生成できるようになりました。

source: It is now possible to use a Redis backend with the Cache extension.
ja_jp: CacheエクステンションでRedisバックエンドを使用することが可能になりました。

source: It is now recommended to use Quarkus REST (formerly RESTEasy Reactive), which supports both traditional blocking workloads and reactive workloads equally well.
ja_jp: 現在は、従来のブロッキングワークロードとリアクティブワークロードの両方を同様にサポートする Quarkus REST (旧称 RESTEasy Reactive) の使用が推奨されています。

source: It is now recommended to use Quarkus REST (formerly RESTEasy Reactive), which supports equally well traditional blocking workloads and reactive workloads. For more information about Quarkus REST, please see the xref:rest-client.adoc[REST Client guide] and, for the server side, the xref:rest-json.adoc[introductory REST JSON guide] or the more detailed xref:rest.adoc[Quarkus REST guide].
ja_jp: Quarkus REST（旧RESTEasy Reactive）は、従来のブロック型ワークロードとリアクティブ型ワークロードを同じようにサポートします。 Quarkus RESTの詳細については、 xref:rest-client.adoc[RESTクライアントガイド] 、サーバーサイドについては、 xref:rest-json.adoc[REST JSON入門ガイド] または詳細な xref:rest.adoc[Quarkus RESTガイド] を参照してください。

source: It is now recommended to use RESTEasy Reactive, which supports both traditional blocking workloads and reactive workloads equally well. For more information about RESTEasy Reactive, please see the xref:rest-json.adoc[introductory REST JSON guide] or the xref:resteasy-reactive.adoc[RESTEasy Reactive reference documentation].
ja_jp: 従来のブロック型ワークロードとリアクティブ型ワークロードの両方を同等にサポートするRESTEasy Reactiveを使用することが推奨されるようになりました。RESTEasy Reactiveの詳細については、 xref:rest-json.adoc[REST JSON入門ガイド] または xref:resteasy-reactive.adoc[RESTEasy Reactiveのリファレンスドキュメント] をご覧ください。

source: It is now recommended to use RESTEasy Reactive, which supports equally well traditional blocking workloads and reactive workloads. For more information about RESTEasy Reactive, please see the xref:rest-client-reactive.adoc[REST Client Reactive guide] and, for the server side, the xref:rest-json.adoc[introductory REST JSON guide] or the more detailed xref:resteasy-reactive.adoc[RESTEasy Reactive guide].
ja_jp: 現在では、従来のブロック型ワークロードとリアクティブ型ワークロードを同様にサポートするRESTEasy Reactiveの使用が推奨されています。RESTEasy Reactiveの詳細については、 link:rest-client-reactive.html[REST Client Reactiveガイド]、サーバーサイドについては、 link:rest-json.html[REST JSON入門ガイド]、またはより詳細な link:resteasy-reactive.html[RESTEasy Reactiveガイド]を参照してください。

source: It is now recommended to use RESTEasy Reactive, which supports equally well traditional blocking workloads and reactive workloads. For more information about RESTEasy Reactive, please see the xref:rest-json.adoc[introductory REST JSON guide] or the more detailed xref:resteasy-reactive.adoc[RESTEasy Reactive guide].
ja_jp: 現在では、従来のブロック型ワークロードとリアクティブ型ワークロードを同様にサポートする RESTEasy Reactive の使用が推奨されています。 RESTEasy Reactive の詳細については、 xref:rest-json.adoc[入門編の REST JSON ガイド]または詳細な xref:resteasy-reactive.adoc[RESTEasy Reactive ガイド]を参照してください。

source: It is now time to define the repository that will be used to access `Fruit`. In a typical Spring Data fashion create a repository like so:
ja_jp: 次に、 `Fruit` へのアクセスに使用されるリポジトリーを定義します。典型的な Spring Data の方法で、次のようなリポジトリーを作成します。

source: It is now time to define the repository that will be used to access `Fruit`. In a typical Spring Data fashion, create a repository like so:
ja_jp: 次に、 `Fruit` にアクセスするためのリポジトリを定義します。典型的なSpring Dataのやり方で、以下のようにリポジトリを作成します:

source: It is now time to migrate your application to OpenTelemetry tracing if you haven’t done it yet.
ja_jp: まだアプリケーションを OpenTelemetry トレーシングに移行していない場合は、今すぐ移行しましょう。

source: It is often desirable to disable the scheduler when running the tests. The scheduler can be disabled through the runtime config property `quarkus.scheduler.enabled`. If set to `false` the scheduler is not started even though the application contains scheduled methods. You can even disable the scheduler for particular <<getting-started-testing#testing_different_profiles,Test Profiles>>.
ja_jp: テストを実行するときは、スケジューラーを無効にすることが望ましい場合がよくあります。 スケジューラーは、ランタイム設定プロパティー `quarkus.scheduler.enabled` を通じて無効にできます。 `false` に設定すると、アプリケーションにスケジュールされたメソッドが含まれていても、スケジューラーは開始されません。 特定のスケジューラー (<<getting-started-testing#testing_different_profiles,Test Profiles>>) を無効にすることもできます。

source: It is often desirable to disable the scheduler when running the tests. The scheduler can be disabled through the runtime config property `quarkus.scheduler.enabled`. If set to `false` the scheduler is not started even though the application contains scheduled methods. You can even disable the scheduler for particular xref:getting-started-testing.adoc#testing_different_profiles[Test Profiles].
ja_jp: テストを実行する際には、スケジューラーを無効にすることが望ましい場合があります。スケジューラは、実行時設定プロパティ（ `quarkus.scheduler.enabled` ）で無効にすることができます。 `false` に設定すると、アプリケーションにスケジュールされたメソッドが含まれていても、スケジューラーは起動しません。特定の xref:getting-started-testing.adoc#testing_different_profiles[テストプロファイル] に対してスケジューラーを無効にすることもできます。

source: It is often the case that the produced classes come from external libraries and don't contain interceptor binding annotations at all. To support such cases, the `@BindingsSource` annotation may be declared on the `InterceptionProxy` parameter:
ja_jp: 生成されたクラスは外部ライブラリーからのものであり、インターセプターバインディングアノテーションがまったく含まれていないことがよくあります。 このようなケースをサポートするには、 `InterceptionProxy` パラメーターで `@BindingsSource` アノテーションを宣言します。

source: It is our great pleasure to announce our new major release of Quarkus: Quarkus 3.0.
ja_jp: Quarkusの新しいメジャーリリースであるQuarkus 3.0を発表できることを大変嬉しく思います。

source: It is our pleasure to announce the availability of Quarkus 3.0.0.CR1.
ja_jp: Quarkus 3.0.0.CR1の提供を開始したことをお知らせします。

source: It is our pleasure to announce the release of Quarkus 2.7.2.Final, our second maintenance release for our 2.7 release train.
ja_jp: Quarkus 2.7.2.Finalのリリースを発表できることを嬉しく思います。2.7リリーストレインの二つ目のメンテナンスリリースです。

source: It is our pleasure to announce the release of Quarkus 3.33, which is our new LTS (Long Term Support) version.
ja_jp: このたび、Quarkusの新しいLTS (Long Term Support) バージョンであるQuarkus 3.33のリリースを発表できることを大変嬉しく思います。

source: It is perfectly valid to have several persistence units pointing to the same datasource.
ja_jp: 複数の永続化ユニットが同じデータソースを使用することもできます。

source: It is possible to add a tag that would convey a little more information, however. Let's adjust our code, and move the counter to add some tags to convey additional information.
ja_jp: しかし、もう少し情報を伝えるためのタグを追加することは可能です。コードを調整して、カウンターを動かし、追加の情報を伝えるタグを追加してみましょう。
